namespace HelloWorld 
{ class Program 
    { static void Main(string[] args) 
        { 
            char n = '8';
            int x  = Convert.ToInt32(n.ToString());
            Console.WriteLine($"x is: {x}");

        } 
    } 
} 

// 1. Напишите программу, которая на вход принимает два числа и проверяет,
// является ли первое число квадратом второго. 

// 2. Напишите программу, которая будет выдавать название дня недели
//  по заданному номеру.